src/main/resources/static/graphviz/erm1.dot
digraph ERD {
graph[rankdir=LR, splines=true];
node [shape=record, fontsize=10, fontname="Verdana"];
edge [style=solid, color="gray"];
"address" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">address</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>city : varchar(255)     </td></tr>
<tr><td>street : varchar(255)     </td></tr>
<tr><td>country_id : bigint     </td></tr>
<tr><td>profile_id : bigint     </td></tr>
<tr><td>state_id : bigint     </td></tr>
</table>>];
"brand" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">brand</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>description : varchar(255)     </td></tr>
<tr><td>name : varchar(255)     </td></tr>
</table>>];
"cart" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">cart</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>customer_id : bigint     </td></tr>
</table>>];
"cart_item" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">cart_item</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>quantity : integer     </td></tr>
<tr><td>cart_id : bigint     </td></tr>
<tr><td>product_id : bigint     </td></tr>
</table>>];
"category" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">category</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>name : varchar(255)     </td></tr>
<tr><td>parent_category_id : bigint     </td></tr>
</table>>];
"country" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">country</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>name : character     </td></tr>
</table>>];
"customer" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">customer</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>email : varchar(255)     </td></tr>
<tr><td>password : varchar(255)     </td></tr>
<tr><td>username : varchar(255)     </td></tr>
<tr><td>profile_id : bigint     </td></tr>
</table>>];
"customer_order" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">customer_order</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>date : varchar(255)     </td></tr>
<tr><td>status : varchar(255)     </td></tr>
<tr><td>total_amount : numeric     </td></tr>
<tr><td>customer_id : bigint     </td></tr>
</table>>];
"discount" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">discount</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>code : varchar(255)     </td></tr>
<tr><td>end_date : date     </td></tr>
<tr><td>percentage : numeric(53)     </td></tr>
<tr><td>start_date : date     </td></tr>
</table>>];
"discount_product" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">discount_product</font></td></tr>
<tr><td>discount_id : bigint     </td></tr>
<tr><td>applicable_products_id : bigint     </td></tr>
</table>>];
"inventory" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">inventory</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>stock_count : integer     </td></tr>
<tr><td>product_id : bigint     </td></tr>
<tr><td>warehouse_id : bigint     </td></tr>
</table>>];
"manufacturer" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">manufacturer</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>name : varchar(32)     </td></tr>
</table>>];
"manufacturer_product" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">manufacturer_product</font></td></tr>
<tr><td>manufacturer_id : bigint     </td></tr>
<tr><td>products_id : bigint     </td></tr>
</table>>];
"order_item" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">order_item</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>quantity : integer     </td></tr>
<tr><td>customer_order_id : bigint     </td></tr>
<tr><td>product_id : bigint     </td></tr>
</table>>];
"payment" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">payment</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>amount : numeric     </td></tr>
<tr><td>date : varchar(255)     </td></tr>
<tr><td>payment_type : varchar(255)     </td></tr>
<tr><td>customer_order_id : bigint     </td></tr>
</table>>];
"payment_detail" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">payment_detail</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>credit_card_number : varchar(255)     </td></tr>
<tr><td>profile_id : bigint     </td></tr>
</table>>];
"product" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">product</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>description : varchar(255)     </td></tr>
<tr><td>name : varchar(255)     </td></tr>
<tr><td>price : numeric     </td></tr>
<tr><td>brand_id : bigint     </td></tr>
<tr><td>category_id : bigint     </td></tr>
</table>>];
"product_tag" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">product_tag</font></td></tr>
<tr><td>products_id : bigint     </td></tr>
<tr><td>tags_id : bigint     </td></tr>
</table>>];
"review" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">review</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>comment : varchar(255)     </td></tr>
<tr><td>rating : integer     </td></tr>
<tr><td>customer_id : bigint     </td></tr>
<tr><td>product_id : bigint     </td></tr>
</table>>];
"shipment" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">shipment</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>status : varchar(255)     </td></tr>
<tr><td>tracking_number : varchar(16)     </td></tr>
<tr><td>customer_order_id : bigint     </td></tr>
</table>>];
"state" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">state</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>name : varchar(255)     </td></tr>
</table>>];
"supplier" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">supplier</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>name : varchar(64)     </td></tr>
</table>>];
"supplier_product" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">supplier_product</font></td></tr>
<tr><td>supplier_id : bigint     </td></tr>
<tr><td>products_id : bigint     </td></tr>
</table>>];
"tag" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">tag</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>description : varchar(128)     </td></tr>
<tr><td>name : varchar(255)     </td></tr>
</table>>];
"user_profile" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">user_profile</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>first_name : varchar(255)     </td></tr>
<tr><td>last_name : varchar(255)     </td></tr>
</table>>];
"warehouse" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">warehouse</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>location : varchar(64)     </td></tr>
<tr><td>name : varchar(32)     </td></tr>
</table>>];
"wishlist" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">wishlist</font></td></tr>
<tr><td>id : bigint     </td></tr>
<tr><td>customer_id : bigint     </td></tr>
</table>>];
"wishlist_product" [shape=none, margin=0, label=<<table border="0" cellborder="1" cellspacing="0" cellpadding="2">
<tr><td bgcolor="dodgerblue4" color="black"><font color="white">wishlist_product</font></td></tr>
<tr><td>wishlist_id : bigint     </td></tr>
<tr><td>products_id : bigint     </td></tr>
</table>>];
"country" -> "address";
"state" -> "address";
"user_profile" -> "address";
"customer" -> "cart";
"cart" -> "cart_item";
"product" -> "cart_item";
"category" -> "category";
"user_profile" -> "customer";
"customer" -> "customer_order";
"discount" -> "discount_product";
"product" -> "discount_product";
"product" -> "inventory";
"warehouse" -> "inventory";
"manufacturer" -> "manufacturer_product";
"product" -> "manufacturer_product";
"customer_order" -> "order_item";
"product" -> "order_item";
"customer_order" -> "payment";
"user_profile" -> "payment_detail";
"brand" -> "product";
"category" -> "product";
"product" -> "product_tag";
"tag" -> "product_tag";
"customer" -> "review";
"product" -> "review";
"customer_order" -> "shipment";
"product" -> "supplier_product";
"supplier" -> "supplier_product";
"customer" -> "wishlist";
"product" -> "wishlist_product";
"wishlist" -> "wishlist_product";
}
